src/ChartsOfCharacteristicTypes/РеквизитыЭлементовФинансовыхОтчетов/РеквизитыЭлементовФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>РеквизитыЭлементовФинансовыхОтчетов</name>
  <type>
    <types>CatalogRef.СтатьиБюджетов</types>
    <types>EnumRef.ПредставлениеПериода</types>
    <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
    <types>CatalogRef.Валюты</types>
    <types>ChartOfAccountsRef.Международный</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.ПоказателиБюджетов</types>
    <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    <types>ChartOfAccountsRef.Хозрасчетный</types>
    <types>EnumRef.ВидыФормулБюджетирования</types>
    <types>EnumRef.ТипыЗначенийПоказателейБюджетногоОтчета</types>
    <types>EnumRef.ТипыИзмеренийФинансовогоОтчета</types>
    <types>String</types>
    <types>EnumRef.ТипыВыводимыхПоказателейБюджетногоОтчета</types>
    <types>Number</types>
    <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
    <types>CatalogRef.Сценарии</types>
    <types>EnumRef.ТипыИтогов</types>
    <types>CatalogRef.НемонетарныеПоказатели</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </items>
    <items>
      <name>ВерхняяГраницаДанных</name>
      <description>Верхняя граница данных</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ВидАналитики</name>
      <description>Вид аналитики</description>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </items>
    <items>
      <name>ВидСубконто</name>
      <description>Вид субконто</description>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </items>
    <items>
      <name>ВыбранныеИсточникиЗначений</name>
      <description>Выбранные источники значений</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводимыеПоказатели</name>
      <description>Выводимые показатели</description>
      <type>
        <types>EnumRef.ТипыВыводимыхПоказателейБюджетногоОтчета</types>
      </type>
    </items>
    <items>
      <name>ВыводитьВместеСРодительским</name>
      <description>Выводить вместе с родительским</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводитьЗаголовокГруппировки</name>
      <description>Выводить заголовок группировки</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводитьЗаголовокЭлемента</name>
      <description>Выводить заголовок элемента</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводитьПоказателиАналогичныхПериодовПрошлыхЛет</name>
      <description>Выводить показатели аналогичных периодов прошлых лет</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводитьПоказателиПредыдущихПериодов</name>
      <description>Выводить показатели предыдущих периодов</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыделитьЭлемент</name>
      <description>Выделить элемент</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ЗаголовокГруппировки</name>
      <description>Заголовок группировки</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ЗначениеПериода</name>
      <description>Значение периода</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ИмяИзмерения</name>
      <description>Имя измерения</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ИсключитьДанныеВводимогоДокументаПриРасчете</name>
      <description>Исключить данные вводимого документа при расчете</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ИспользоватьФильтрПоОрганизации</name>
      <description>Использовать фильтр по организации</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ИспользоватьФильтрПоПодразделению</name>
      <description>Использовать фильтр по подразделению</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ИспользоватьФильтрПоСценарию</name>
      <description>Использовать фильтр по сценарию</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ИсточникВсеЭлементы</name>
      <description>Источник все значения</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КодСтрокиОтчета</name>
      <description>Код строки отчета</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>КоличествоПредыдущихЛет</name>
      <description>Количество предыдущих лет</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>КоличествоПредыдущихПериодов</name>
      <description>Количество предыдущих периодов</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>КолонкаЯчейки</name>
      <description>Колонка ячейки</description>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </items>
    <items>
      <name>КонецПериодаГруппировки</name>
      <description>Конец периода группировки</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>НачалоПериодаГруппировки</name>
      <description>Начало периода группировки</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>НачальноеСальдо</name>
      <description>Начальное сальдо</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>НемонетарныйПоказатель</name>
      <description>Немонетарный показатель</description>
      <type>
        <types>CatalogRef.НемонетарныеПоказатели</types>
      </type>
    </items>
    <items>
      <name>НефинансовыйПоказатель</name>
      <description>Нефинансовый показатель</description>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </items>
    <items>
      <name>НижняяГраницаДанных</name>
      <description>Нижняя граница данных</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Организация</name>
      <description>Организация</description>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ОтображатьНумерациюКолонок</name>
      <description>Отображать нумерацию колонок</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ОтображатьНумерациюСтрок</name>
      <description>Отображать нумерацию строк</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПериодСмещения</name>
      <description>Период смещения</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Периодичность</name>
      <description>Периодичность</description>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </items>
    <items>
      <name>ПериодичностьСмещения</name>
      <description>Периодичность смещения</description>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ПоказательБюджетов</name>
      <description>Показатель бюджетов</description>
      <type>
        <types>CatalogRef.ПоказателиБюджетов</types>
      </type>
    </items>
    <items>
      <name>ПредставлениеПериода</name>
      <description>Представление периода</description>
      <type>
        <types>EnumRef.ПредставлениеПериода</types>
      </type>
    </items>
    <items>
      <name>ПривилегированныйРежим</name>
      <description>Привилегированный режим</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Примечание</name>
      <description>Примечание</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>РазрешитьРедактирование</name>
      <description>Разрешено добавление</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Сортировка</name>
      <description>Сортировка</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СпособЗаполнения</name>
      <description>Способ заполнения</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>СтатьяБюджетов</name>
      <description>Статья бюджетов</description>
      <type>
        <types>CatalogRef.СтатьиБюджетов</types>
      </type>
    </items>
    <items>
      <name>СтрокаЯчейки</name>
      <description>Строка ячейки</description>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </items>
    <items>
      <name>Сценарий</name>
      <description>Сценарий</description>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </items>
    <items>
      <name>СчетПланаСчетов</name>
      <description>Счет плана счетов</description>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </items>
    <items>
      <name>Текст</name>
      <description>Текст</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ТипЗначенияПоказателя</name>
      <description>Тип значения показателя</description>
      <type>
        <types>EnumRef.ТипыЗначенийПоказателейБюджетногоОтчета</types>
      </type>
    </items>
    <items>
      <name>ТипИзмерения</name>
      <description>Тип измерения</description>
      <type>
        <types>EnumRef.ТипыИзмеренийФинансовогоОтчета</types>
      </type>
    </items>
    <items>
      <name>ТипИтога</name>
      <description>Тип итога</description>
      <type>
        <types>EnumRef.ТипыИтогов</types>
      </type>
    </items>
    <items>
      <name>ТипРедактируемогоЗначения</name>
      <description>Тип редактируемого значения</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ТолькоДляПечати</name>
      <description>Только для печати</description>
      <type>
        <types>CatalogRef.СтатьиБюджетов</types>
        <types>EnumRef.ПредставлениеПериода</types>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
        <types>CatalogRef.Валюты</types>
        <types>ChartOfAccountsRef.Международный</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>Boolean</types>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
        <types>EnumRef.Периодичность</types>
        <types>CatalogRef.ПоказателиБюджетов</types>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
        <types>EnumRef.ВидыФормулБюджетирования</types>
        <types>EnumRef.ТипыЗначенийПоказателейБюджетногоОтчета</types>
        <types>EnumRef.ТипыИзмеренийФинансовогоОтчета</types>
        <types>String</types>
        <types>EnumRef.ТипыВыводимыхПоказателейБюджетногоОтчета</types>
        <types>Number</types>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
        <types>CatalogRef.Сценарии</types>
        <types>EnumRef.ТипыИтогов</types>
        <types>CatalogRef.НемонетарныеПоказатели</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Точность</name>
      <description>Точность</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФормулаПоГруппе</name>
      <description>Формула</description>
      <type>
        <types>EnumRef.ВидыФормулБюджетирования</types>
      </type>
    </items>
    <items>
      <name>Формула</name>
      <description>Формула</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ЭтоАналитикаПрочее</name>
      <description>Это аналитика прочее</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ЭтоСвязанный</name>
      <description>Это связанный</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ВыводитьИерархиюЭлементов</name>
      <description>Выводить иерархию элементов</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/ChartsOfCharacteristicTypes/РеквизитыЭлементовФинансовыхОтчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 плана видов характеристик.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();

	#Область Валюта
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Валюта";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Валюты"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Валюта';
								|en = 'Currency'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВерхняяГраницаДанных
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВерхняяГраницаДанных";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Верхняя граница данных';
								|en = 'Upper bound of data'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВидАналитики
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВидАналитики";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Вид аналитики';
								|en = 'Dimension kind'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВидСубконто
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВидСубконто";
	МассивТипов = Новый Массив;
	//++ НЕ УТКА
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоМеждународные"));
	//-- НЕ УТКА

	//++ Локализация
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	//-- Локализация
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Вид субконто';
								|en = 'Extra dimension type'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыбранныеИсточникиЗначений
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыбранныеИсточникиЗначений";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выбранные источники значений';
								|en = 'Selected value sources'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыводимыеПоказатели
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводимыеПоказатели";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыВыводимыхПоказателейБюджетногоОтчета"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводимые показатели';
								|en = 'Displayed indicators'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыводитьВместеСРодительским
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводитьВместеСРодительским";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводить вместе с родительским';
								|en = 'Display with parent'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыводитьЗаголовокГруппировки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводитьЗаголовокГруппировки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводить заголовок группировки';
								|en = 'Display grouping title'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыводитьЗаголовокЭлемента
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводитьЗаголовокЭлемента";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводить заголовок элемента';
								|en = 'Display item title'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыделитьЭлемент
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыделитьЭлемент";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выделить элемент';
								|en = 'Select item'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ЗаголовокГруппировки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗаголовокГруппировки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Заголовок группировки';
								|en = 'Grouping title'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ЗначениеПериода
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗначениеПериода";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Значение периода';
								|en = 'Period value'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИмяИзмерения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИмяИзмерения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Имя измерения';
								|en = 'Dimension name'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИсключитьДанныеВводимогоДокументаПриРасчете
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИсключитьДанныеВводимогоДокументаПриРасчете";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Исключить данные вводимого документа при расчете';
								|en = 'Exclude entered document data during calculation'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИспользоватьФильтрПоОрганизации
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИспользоватьФильтрПоОрганизации";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Использовать фильтр по организации';
								|en = 'Use filter by company'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИспользоватьФильтрПоПодразделению
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИспользоватьФильтрПоПодразделению";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Использовать фильтр по подразделению';
								|en = 'Use filter by business unit'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИспользоватьФильтрПоСценарию
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИспользоватьФильтрПоСценарию";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Использовать фильтр по сценарию';
								|en = 'Use filter by scenario'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ИсточникВсеЭлементы
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИсточникВсеЭлементы";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Источник все значения';
								|en = 'Source all values'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область КодСтрокиОтчета
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КодСтрокиОтчета";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Код строки отчета';
								|en = 'Report line code'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область КолонкаЯчейки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КолонкаЯчейки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Колонка ячейки';
								|en = 'Cell column'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область КонецПериодаГруппировки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КонецПериодаГруппировки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Конец периода группировки';
								|en = 'Grouping period end'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область НачалоПериодаГруппировки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачалоПериодаГруппировки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Начало периода группировки';
								|en = 'Grouping period start'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область НачальноеСальдо
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачальноеСальдо";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Начальное сальдо';
								|en = 'Opening balance'", КодОсновногоЯзыка);
	#КонецОбласти
	//++ НЕ УТКА

	#Область НемонетарныйПоказатель
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НемонетарныйПоказатель";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.НемонетарныеПоказатели"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Немонетарный показатель';
								|en = 'Non-monetary item'", КодОсновногоЯзыка);
	#КонецОбласти
	//-- НЕ УТКА

	#Область НефинансовыйПоказатель
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НефинансовыйПоказатель";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.НефинансовыеПоказателиБюджетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Нефинансовый показатель';
								|en = 'Non-financial item'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область НижняяГраницаДанных
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НижняяГраницаДанных";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Нижняя граница данных';
								|en = 'Lower bound of data'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Организация
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Организация";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Организация';
								|en = 'Company'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ОтображатьНумерациюКолонок
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтображатьНумерациюКолонок";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Отображать нумерацию колонок';
								|en = 'Display column numbering'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ОтображатьНумерациюСтрок
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтображатьНумерациюСтрок";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Отображать нумерацию строк';
								|en = 'Display line numbering'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Периодичность
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Периодичность";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.Периодичность"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Периодичность';
								|en = 'Frequency'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ПериодичностьСмещения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПериодичностьСмещения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.Периодичность"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Периодичность смещения';
								|en = 'Offset frequency'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ПериодСмещения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПериодСмещения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Период смещения';
								|en = 'Offset period'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Подразделение
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Подразделение";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Подразделение';
								|en = 'Business unit'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ПоказательБюджетов
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПоказательБюджетов";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ПоказателиБюджетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Показатель бюджетов';
								|en = 'Budget balance item'", КодОсновногоЯзыка);
	#КонецОбласти
	//++ НЕ УТКА

	#Область ПредставлениеПериода
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПредставлениеПериода";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ПредставлениеПериода"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Представление периода';
								|en = 'Period presentation'", КодОсновногоЯзыка);
	#КонецОбласти
	//-- НЕ УТКА

	#Область ПривилегированныйРежим
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПривилегированныйРежим";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Привилегированный режим';
								|en = 'Privileged mode'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Примечание
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Примечание";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Примечание';
								|en = 'Note'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область РазрешитьРедактирование
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РазрешитьРедактирование";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Разрешено добавление';
								|en = 'Adding is allowed'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Сортировка
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Сортировка";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Сортировка';
								|en = 'Sort'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область СпособЗаполнения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СпособЗаполнения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Способ заполнения';
								|en = 'Filling method'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область СтатьяБюджетов
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтатьяБюджетов";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиБюджетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Статья бюджетов';
								|en = 'Budget flow item'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область СтрокаЯчейки
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СтрокаЯчейки";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Строка ячейки';
								|en = 'Cell line'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Сценарий
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Сценарий";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Сценарии"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Сценарий';
								|en = 'Scenario'", КодОсновногоЯзыка);
	#КонецОбласти
	//++ НЕ УТКА
	
	#Область СчетПланаСчетов
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетПланаСчетов";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПланСчетовСсылка.Международный"));
	//++ Локализация
	МассивТипов.Добавить(Тип("ПланСчетовСсылка.Хозрасчетный"));
	//-- Локализация
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Счет плана счетов';
								|en = 'Account of chart of accounts'", КодОсновногоЯзыка);
	#КонецОбласти
	//-- НЕ УТКА

	#Область Текст
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Текст";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Текст';
								|en = 'Text'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ТипЗначенияПоказателя
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТипЗначенияПоказателя";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыЗначенийПоказателейБюджетногоОтчета"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Тип значения показателя';
								|en = 'Indicator value type'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ТипИзмерения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТипИзмерения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыИзмеренийФинансовогоОтчета"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Тип измерения';
								|en = 'Dimension type'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ТипИтога
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТипИтога";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыИтогов"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Тип итога';
								|en = 'Total type'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ТипРедактируемогоЗначения
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТипРедактируемогоЗначения";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Тип редактируемого значения';
								|en = 'Edited value type'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ТолькоДляПечати
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТолькоДляПечати";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиБюджетов"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Валюты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.Периодичность"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПоказателиБюджетов"));
	//++ Локализация
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	МассивТипов.Добавить(Тип("ПланСчетовСсылка.Хозрасчетный"));
	//-- Локализация
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыФормулБюджетирования"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыЗначенийПоказателейБюджетногоОтчета"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыИзмеренийФинансовогоОтчета"));
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыВыводимыхПоказателейБюджетногоОтчета"));
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов"));
	МассивТипов.Добавить(Тип("СправочникСсылка.НефинансовыеПоказателиБюджетов"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Сценарии"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ТипыИтогов"));
	//++ НЕ УТКА
	МассивТипов.Добавить(Тип("ПланСчетовСсылка.Международный"));//
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ПредставлениеПериода"));
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоМеждународные"));
	МассивТипов.Добавить(Тип("СправочникСсылка.НемонетарныеПоказатели"));
	//-- НЕ УТКА
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Только для печати';
								|en = 'Only for printing'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Точность
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Точность";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Точность';
								|en = 'Precision'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область Формула
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Формула";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Формула';
								|en = 'Formula'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ФормулаПоГруппе
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФормулаПоГруппе";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыФормулБюджетирования"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Формула';
								|en = 'Formula'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ЭтоАналитикаПрочее
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭтоАналитикаПрочее";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Это аналитика прочее';
								|en = 'This is dimension other'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ЭтоСвязанный
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭтоСвязанный";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Это связанный';
								|en = 'This is associated'", КодОсновногоЯзыка);
	#КонецОбласти

	#Область ВыводитьПоказателиАналогичныхПериодовПрошлыхЛет
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводитьПоказателиАналогичныхПериодовПрошлыхЛет";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводить показатели аналогичных периодов прошлых лет';
								|en = 'Show indicators of similar periods of previous years'", КодОсновногоЯзыка);
	#КонецОбласти
	
	#Область ВыводитьПоказателиПредыдущихПериодов
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыводитьПоказателиПредыдущихПериодов";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Выводить показатели предыдущих периодов';
								|en = 'Show indicators of previous periods'", КодОсновногоЯзыка);
	#КонецОбласти
	
	#Область КоличествоПредыдущихЛет
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КоличествоПредыдущихЛет";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Количество предыдущих лет';
								|en = 'Number of previous years'", КодОсновногоЯзыка);
	#КонецОбласти
	
	#Область КоличествоПредыдущихПериодов
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КоличествоПредыдущихПериодов";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Элемент.ТипЗначения = ОписаниеТипа;
	Элемент.Наименование = НСтр("ru = 'Количество предыдущих периодов';
								|en = 'Number of previous periods'", КодОсновногоЯзыка);
	#КонецОбласти

КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - ПланВидовХарактеристикОбъект.РеквизитыЭлементовФинансовыхОтчетов - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
